Repository: alwynou/mira
Catalog: Apps/MiraMac/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Enter a service URL without credentials, query parameters, or fragments.
zh_hans: 请填写不含凭据、查询参数或片段的服务地址。

source: Enter a valid context window, or leave it unknown.
zh_hans: 请输入有效的上下文窗口，或将其留空表示未知。

source: Enter a valid maximum output token count and select a model.
zh_hans: 请输入有效的最大输出令牌数并选择模型。

source: Enter an API key.
zh_hans: 请填写 API 密钥。

source: Enter the model ID manually. You can save without a context window, but must provide one before sending. Tool capability is not inferred automatically. Saving a connection does not incur model fees.
zh_hans: Model ID 可手工填写；窗口未知时可以保存连接，发送前必须补齐。此阶段不自动推断工具能力。保存连接不会产生模型费用。

source: Enter valid token limits. Maximum output must be smaller than the context window.
zh_hans: 请输入有效的 Token 数；最大输出须小于上下文窗口。

source: Estimate is based on UTF-8 and protocol overhead, not the provider's exact token count.
zh_hans: 估算以 UTF-8 与协议开销计算，不是服务商精确 Token 数。

source: Evidence
zh_hans: 证据

source: Evidence body is unavailable.
zh_hans: 证据正文不可用。

source: Evidence excerpt
zh_hans: 证据摘录

source: Execution %@: failed, cancelled, or interrupted replies are excluded from history.
zh_hans: 执行 %@：失败、取消或中断的回复不进入历史。

source: Execution details
zh_hans: 执行详情

source: Execution failed
zh_hans: 执行失败

source: Execution limits are invalid.
zh_hans: 执行限额无效。

source: Execution steps must be created in order.
zh_hans: 执行步骤必须按顺序创建。

source: Explicit selection
zh_hans: 显式选择

source: Export Library Backup…
zh_hans: 导出资料库备份…

source: Fact
zh_hans: 事实

source: Failed
zh_hans: 失败

source: First configure a context window greater than 128 tokens, then run the capability check.
zh_hans: 请先配置大于 128 Token 的上下文窗口，再检测能力。

source: General
zh_hans: 通用

source: Generating
zh_hans: 正在生成

source: Generation was stopped.
zh_hans: 已停止生成。

source: Global
zh_hans: 全局

source: Global default
zh_hans: 全局默认值

source: Global memory
zh_hans: 全局记忆

source: Goal
zh_hans: 目标

source: I confirm this model supports streaming text conversations
zh_hans: 我已确认模型支持流式文本对话

source: Inbox
zh_hans: 收件箱

source: Includes actual requests, tool parameters, and results; API keys are excluded. Tool observations are reused only for the current turn.
zh_hans: 包含实际请求、工具参数和结果，不包含 API Key。工具观察只在当前回合续用。

source: Incomplete
zh_hans: 未完成

source: Inherit / no binding
zh_hans: 继承 / 不绑定

source: Input tokens
zh_hans: 输入 Token

source: Interrupted
zh_hans: 已中断

source: Interrupted · check the result
zh_hans: 已中断 · 请核对结果

source: Invalid arguments · not executed
zh_hans: 参数无效 · 未执行

source: Keep an exact excerpt from the original message, up to 8 KiB.
zh_hans: 保留原始消息中的精确摘录，最多 8 KiB。

source: Keychain could not remove the old credentials.
zh_hans: Keychain 暂时无法移除旧凭据。

source: Keychain could not save the key. Existing credentials were not replaced.
zh_hans: Keychain 保存失败，原有凭据未被替换。

source: Keychain credential
zh_hans: 钥匙串凭据

source: Kind
zh_hans: 类型

source: Language
zh_hans: 语言

source: Latest Text Test
zh_hans: 最近的文本测试

source: Latest Tool Test
zh_hans: 最近的工具测试

source: Latest turn
zh_hans: 最新回合

source: Learning
zh_hans: 经验

source: Limit exceeded
zh_hans: 超出限额

source: Loading memory
zh_hans: 正在加载记忆

source: Local Demo
zh_hans: 本机演示

source: Local Library
zh_hans: 本地资料库

source: Local demo
zh_hans: 本机演示

source: Local demo · no network requests
zh_hans: 本机演示 · 不发送网络请求

source: Local execution record
zh_hans: 本机执行记录

source: Local only
zh_hans: 仅限本机

source: Manual entry
zh_hans: 手动输入

source: Manual memory evidence is required and must be at most 8 KiB.
zh_hans: 手动记忆证据为必填，且不得超过 8 KiB。

source: Maximum Output (tokens)
zh_hans: 最大输出（Token）

source: Maximum Output Tokens
zh_hans: 最大输出令牌数

source: Maximum output tokens must be smaller than the model context window.
zh_hans: 最大输出令牌数必须小于模型上下文窗口。

source: Maximum output: %@ tokens
zh_hans: 最大输出：%@ Token

source: May be included in future model requests
zh_hans: 可能包含在未来的模型请求中

source: Memories
zh_hans: 记忆

source: Memory
zh_hans: 记忆

source: Memory Extraction
zh_hans: 记忆提取

source: Memory approval timed out.
zh_hans: 记忆审批已超时。

source: Memory arguments are incomplete.
zh_hans: 记忆参数不完整。

source: Memory body unavailable
zh_hans: 记忆正文不可用

source: Memory content
zh_hans: 记忆内容

source: Memory content is required and must be at most 8 KiB.
zh_hans: 记忆内容为必填，且不得超过 8 KiB。

source: Memory content is stored locally. Scope controls where it may be recalled; remote use is a separate disclosure choice.
zh_hans: 记忆内容存储在本机。范围决定记忆可在哪里召回；远程使用是单独的披露选项。

source: Memory evidence excerpt is required and must be short.
zh_hans: 记忆证据摘录为必填且必须较短。

source: Memory evidence must be an exact excerpt from the source message.
zh_hans: 记忆证据必须是源消息中的精确摘录。

source: Memory evidence must be an exact excerpt of at most 8 KiB from the original message.
zh_hans: 记忆证据必须是原始消息中不超过 8 KiB 的精确摘录。

source: Memory evidence must cite a committed user message.
zh_hans: 记忆证据必须引用已提交的用户消息。

source: Memory intent configuration is unavailable.
zh_hans: 记忆意图配置不可用。

source: Memory reference
zh_hans: 记忆引用

source: Memory reference unavailable
zh_hans: 记忆引用不可用

source: Memory result limit must be positive.
zh_hans: 记忆结果数量限制必须为正数。

source: Memory revisions cannot change scope or subject.
zh_hans: 记忆修订不能更改范围或主体。

source: Memory scope and sensitivity are required.
zh_hans: 记忆范围和敏感度为必填项。

source: Memory search query is too long.
zh_hans: 记忆搜索查询过长。

source: Memory validity must end after it starts.
zh_hans: 记忆有效期结束时间必须晚于开始时间。

source: Memory · revision %lld
zh_hans: 记忆 · 版本 %lld

source: Message input
zh_hans: 消息输入框

source: Messages cannot be sent to an archived conversation.
zh_hans: 归档对话不能发送消息。

source: Mira Documentation
zh_hans: Mira 项目文档

source: Missing connection
zh_hans: 缺少连接

source: Missing model
zh_hans: 缺少模型

source: Model
zh_hans: 模型

source: Model ID
zh_hans: 模型 ID

source: Model attempts must be created in order.
zh_hans: 模型尝试必须按顺序创建。

source: Model call completed
zh_hans: 模型调用完成

source: Model call failed
zh_hans: 模型调用失败

source: Model call interrupted
zh_hans: 模型调用中断

source: Model configuration changed. Send the request again.
zh_hans: 模型配置已改变，请重新发送。

source: Model output and an error cannot be submitted together.
zh_hans: 模型输出与错误不能同时提交。

source: Model removed.
zh_hans: 模型已移除。

source: Models
zh_hans: 模型

source: Name
zh_hans: 名称

source: Named presets hold output limits and usage reporting. Assign them to purposes in Purpose Routing.
zh_hans: 命名预设包含输出限制和用量报告设置。请在“用途路由”中将它们分配给用途。

source: Needs reconfirmation
zh_hans: 需要重新确认

source: Needs review
zh_hans: 需要审核

source: New API Key (leave blank to keep)
zh_hans: 新的 API 密钥（留空以保留现有密钥）

source: New conversation
zh_hans: 新对话

source: New memory
zh_hans: 新建记忆

source: No API key
zh_hans: 没有 API 密钥

source: No Connections
zh_hans: 没有连接

source: No Model Connected
zh_hans: 尚未连接模型

source: No Models
zh_hans: 没有模型

source: No Routes
zh_hans: 没有路由

source: No archived conversations
zh_hans: 没有归档对话

source: No conversations yet
zh_hans: 还没有对话

source: No model configured
zh_hans: 尚未配置模型

source: No provider connections configured.
zh_hans: 未配置提供商连接。

source: Not authorized
zh_hans: 未获授权

source: OK
zh_hans: 好

source: Only a committed user message can be used as memory evidence.
zh_hans: 只有已提交的用户消息可以用作记忆证据。

source: Only a failed attempt with no output or tool calls can be retried.
zh_hans: 只有无输出且无工具调用的失败尝试可以重试。

source: Only a finished failed execution can be retried.
zh_hans: 只有已结束且失败的执行可以重试。

source: Only selected connections may receive this workspace's content. Selecting none blocks all connections.
zh_hans: 只有选中的连接可以接收此工作空间的内容。不勾选任何连接将禁止所有连接。

source: Only tool-call output can continue to the next step.
zh_hans: 只有工具调用输出可以继续下一步骤。

source: Open conversation
zh_hans: 打开对话

source: OpenAI Chat Completions Compatible
zh_hans: 兼容 OpenAI Chat Completions

source: Operation did not complete. Retry; if the problem persists, back up the library.
zh_hans: 操作未完成。请重试；如果问题持续，请备份资料库。

source: Operation incomplete
zh_hans: 操作未完成

source: Organize your thoughts, discuss a project, or ask a question. Choose a model, then write your first message.
zh_hans: 整理思路、讨论项目，或提出一个问题。 选择模型后，写下第一条消息。

source: Original user excerpt
zh_hans: 原始用户摘录

source: Original user request is unavailable.
zh_hans: 原始用户请求不可用。

source: Output limit reached. Adjust the model configuration and retry.
zh_hans: 已达到输出上限，可调整模型配置后重试。

source: Output reservation for this turn reached its limit. Start a new conversation.
zh_hans: 本回合已达到模型输出预留预算，请新建对话。

source: Output tokens
zh_hans: 输出 Token

source: Passed
zh_hans: 通过

source: Preference
zh_hans: 偏好

source: Previous %@
zh_hans: 原记忆 %@

source: Procedure
zh_hans: 流程

source: Project background
zh_hans: 项目背景

source: Protocol
zh_hans: 协议

source: Provider endpoints and Keychain credential references are shared by model descriptors.
zh_hans: 模型描述共享提供商端点和钥匙串凭据引用。

source: Provider origin
zh_hans: 提供商来源

source: Providers
zh_hans: 模型服务

source: Purpose
zh_hans: 用途

source: Purpose Routing
zh_hans: 用途路由

source: Queued
zh_hans: 等待发送

source: Remember this message…
zh_hans: 记住这条消息……

source: Remove
zh_hans: 移除

source: Remove Binding / Inherit
zh_hans: 移除绑定 / 继承

source: Removing a connection also removes its model descriptors, routes, and purpose bindings.
zh_hans: 移除连接也会移除其模型描述、路由和用途绑定。

source: Replace memory
zh_hans: 替换记忆

source: Replacement %@
zh_hans: 替代记忆 %@

source: Reply content cleared after forgetting a memory
zh_hans: 遗忘记忆后，回复内容已清除

source: Reply exceeded the local safety limit.
zh_hans: 回复超过本地安全上限。

source: Reply has not been saved and is being kept in the current app. Check available disk space, then click "Retry Save."
zh_hans: 回复尚未保存，已保留在当前应用中。请检查磁盘空间，然后点击“重试保存”。

source: Reply pending save
zh_hans: 回复待保存

source: Request not sent yet
zh_hans: 尚未发送请求

source: Request snapshot
zh_hans: 请求快照

source: Request streaming token usage (requires include_usage support)
zh_hans: 请求流式 Token 用量（服务需支持 include_usage）

source: Request streaming token usage when supported
zh_hans: 支持时请求流式用量

source: Request unavailable
zh_hans: 请求不可用

source: Restore to New Directory…
zh_hans: 恢复到新目录…

source: Restored Library
zh_hans: 已恢复的资料库

source: Restrict provider connections
zh_hans: 限制提供商连接

source: Retry Credential Cleanup
zh_hans: 重试凭据清理

source: Retry last turn
zh_hans: 重试最后回合

source: Retry save
zh_hans: 重试保存

source: Review memory request
zh_hans: 查看记忆请求

source: Revision %@
zh_hans: 修订 %@

source: Revision %lld used in this reply
zh_hans: 此回复使用的版本 %lld

source: Route
zh_hans: 路由

source: Route preset
zh_hans: 路由预设

source: Route removed.
zh_hans: 路由已移除。

source: Route revision %lld · Conservative input estimate %@
zh_hans: 路线版本 %lld · 输入保守估算 %@

source: Route selection
zh_hans: 路由选择

source: Routes
zh_hans: 路由

source: Running
zh_hans: 执行中

source: Save
zh_hans: 保存

source: Save Binding
zh_hans: 保存绑定

source: Save memory
zh_hans: 保存记忆

source: Save revision
zh_hans: 保存修订

source: Scope
zh_hans: 范围

source: Select a connection
zh_hans: 选择连接

source: Select a model
zh_hans: 选择模型

source: Select a provider connection first.
zh_hans: 请先选择提供商连接。

source: Send
zh_hans: 发送

source: Send a message…
zh_hans: 发送消息…

source: Sensitive memory
zh_hans: 敏感记忆

source: Service URL is invalid.
zh_hans: 服务地址无效。

source: Service URL must use HTTPS; explicitly enable HTTP for loopback services.
zh_hans: 服务地址需要 HTTPS；本机 HTTP 服务须明确启用。

source: Service did not provide this
zh_hans: 服务未提供

source: Service returned data after the stream ended.
zh_hans: 服务在结束后仍返回数据。

source: Service returned invalid usage.
zh_hans: 服务返回的用量无效。

source: Service returned tool calls with missing identities, duplicates, or excessive limits.
zh_hans: 服务返回的工具调用缺失身份、重复或超出限制。

source: Set valid from
zh_hans: 设置有效开始时间

source: Set valid until
zh_hans: 设置有效结束时间

source: Settings
zh_hans: 设置

source: Show active conversations
zh_hans: 显示活动对话

source: Show archived conversations
zh_hans: 显示归档对话

source: Source revision %@
zh_hans: 来源修订 %@

source: Source: committed user message
zh_hans: 来源：已提交的用户消息

source: Start with an idea
zh_hans: 从一个想法开始

source: Status
zh_hans: 状态

source: Step %lld · Attempt %lld
zh_hans: 步骤 %lld · 尝试 %lld

source: Stop
zh_hans: 停止

source: Stopped
zh_hans: 已停止

source: Stopped; the tool was not executed.
zh_hans: 已停止，工具尚未执行。

source: Subject
zh_hans: 主体

source: Superseded by %@
zh_hans: 已被 %@ 替代

source: Supports OpenAI Chat Completions-compatible APIs and Anthropic Messages. API keys stay in this Mac's Keychain. Adding a connection does not send a test request.
zh_hans: 首批支持 OpenAI Chat Completions 兼容接口和 Anthropic Messages。API Key 仅存入本机 Keychain，连接不会自动发送测试请求。

source: Test Text
zh_hans: 测试文本

source: Test Tools
zh_hans: 测试工具

source: Test cancelled. Capability status was not changed.
zh_hans: 测试已取消。能力状态未更改。

source: Test passed. Capability status saved.
zh_hans: 检测成功，已保存能力状态。

source: Testing with synthetic content only, without conversation history…
zh_hans: 仅使用合成内容测试，不包含对话历史……

source: Tests send a fixed synthetic prompt without personal history. Your provider may charge a small API fee.
zh_hans: 检测仅发送固定合成提示，不包含个人历史；所选模型服务可能收取少量 API 费用。

source: Text
zh_hans: 文本

source: Text capability check result does not meet requirements.
zh_hans: 文本能力检测结果不符合要求。

source: Text capability declared
zh_hans: 已声明文本能力

source: The app is shutting down and cannot start a new request.
zh_hans: 应用正在退出，无法启动新请求。

source: The assistant proposes saving this memory. Review its content, source, and scope before allowing it.
zh_hans: 助手建议保存这条记忆。请在允许前查看其内容、来源和范围。

source: The attempt index for a new step is invalid.
zh_hans: 新步骤的尝试序号无效。

source: The attempt index is duplicated for this step.
zh_hans: 同一步骤的尝试序号重复。

source: The backup contains an unknown database schema.
zh_hans: 备份包含未知资料库结构。

source: The backup contains unknown database migrations.
zh_hans: 备份包含未知资料库迁移。

source: The backup contains unknown database objects.
zh_hans: 备份包含未知资料库对象。

source: The backup destination already exists.
zh_hans: 备份目标已存在。

source: The backup schema or constraints do not match the current version.
zh_hans: 备份结构或约束与当前版本不符。

source: The backup version is not supported by the current restorer.
zh_hans: 备份版本不受当前恢复器支持。

source: The captured memory is no longer available for this execution.
zh_hans: 捕获的记忆不再可用于此执行。

source: The connection changed. Test results did not overwrite the new configuration.
zh_hans: 连接配置已变化，检测结果未覆盖新的编辑内容。

source: The conversation does not exist.
zh_hans: 对话不存在。

source: The conversation does not match the routing workspace.
zh_hans: 对话与路由工作空间不匹配。

source: The conversation information is invalid.
zh_hans: 对话信息无效。

source: The conversation still has an execution in progress.
zh_hans: 对话仍有执行正在进行。

source: The credential cleanup ledger version is unsupported.
zh_hans: 凭据清理记录版本不受支持。

source: The current memory is no longer available.
zh_hans: 当前记忆已不可用。

source: The current user message no longer authorizes this memory.
zh_hans: 当前用户消息已不再授权此记忆。

source: The database audit contents are invalid.
zh_hans: 资料库审计内容无效。

source: The database audit request identity is invalid.
zh_hans: 资料库审计请求身份无效。

source: The database contents are invalid.
zh_hans: 资料库内容无效。

source: The database directory is invalid.
zh_hans: 资料库目录无效。

source: The database model attempt status is invalid.
zh_hans: 资料库模型尝试状态无效。

source: The database model call does not match the tool audit.
zh_hans: 资料库模型调用与工具审计不匹配。

source: The database purged attempt marker is invalid.
zh_hans: 数据库中的模型尝试清除标记无效。

source: The database purged draft marker is invalid.
zh_hans: 资料库已清除草稿标记无效。

source: The database request contents are invalid.
zh_hans: 资料库请求内容无效。

source: The database tool call association is invalid.
zh_hans: 资料库工具调用关联无效。

source: The database tool call status is invalid.
zh_hans: 资料库工具调用状态无效。

source: The database tool result is invalid.
zh_hans: 资料库工具结果无效。

source: The database was created by a newer version and cannot be opened here.
zh_hans: 资料库版本较新，无法在此版本打开。

source: The execution body has been purged or the execution has already finished.
zh_hans: 执行正文已清除，或执行已完成。

source: The execution does not exist.
zh_hans: 执行不存在。

source: The execution has already finished.
zh_hans: 执行已经结束。

source: The execution has finished; the draft cannot be saved.
zh_hans: 执行已结束，无法保存草稿。

source: The execution history dependency is invalid.
zh_hans: 执行历史依赖无效。

source: The execution is no longer waiting.
zh_hans: 执行已离开等待状态。

source: The execution route snapshot is invalid.
zh_hans: 执行路由快照无效。

source: The execution step body has been purged.
zh_hans: 执行步骤正文已清除。

source: The execution step index is invalid.
zh_hans: 执行步骤序号无效。

source: The execution still has unfinished model attempts or tool calls.
zh_hans: 执行仍有未完成的模型尝试或工具调用。

source: The execution terminal state is invalid.
zh_hans: 执行终态无效。

source: The execution trigger message is invalid.
zh_hans: 执行触发消息无效。

source: The execution was interrupted.
zh_hans: 执行已中断。

source: The first step index is invalid.
zh_hans: 首个步骤的序号无效。

source: The forgotten memory still contains a body.
zh_hans: 已忘记的记忆仍包含正文。

source: The history execution dependency is invalid.
zh_hans: 历史执行依赖无效。

source: The history message execution reference is invalid.
zh_hans: 历史消息执行引用无效。

source: The history message reference is invalid.
zh_hans: 历史消息引用无效。

source: The library is not open.
zh_hans: 库尚未打开。

source: The manual memory source ID is already bound to different or purged content.
zh_hans: 手动记忆源 ID 已绑定到不同内容或已清除的内容。

source: The memory and its revisions will be cleared. Original user messages remain visible in conversation history. Linked generated replies and audit bodies will be cleared.
zh_hans: 这条记忆及其修订记录将被清除。原始用户消息仍会显示在对话历史中。关联的生成回复和审计正文将被清除。

source: The memory contents are inconsistent.
zh_hans: 记忆内容不一致。

source: The memory context reference is invalid.
zh_hans: 记忆上下文引用无效。

source: The memory context references disagree.
zh_hans: 记忆上下文引用不一致。

source: The memory deletion state is invalid.
zh_hans: 记忆删除状态无效。

source: The memory disclosure policy does not match the reviewed content.
zh_hans: 记忆披露策略与已审核内容不匹配。

source: The memory does not exist.
zh_hans: 记忆不存在。

source: The memory draft scope or subject is inconsistent.
zh_hans: 记忆草稿的范围或主体不一致。

source: The memory draft scope, subject, or assertion hash is inconsistent.
zh_hans: 记忆草稿的范围、主体或断言哈希不一致。

source: The memory evidence contents are inconsistent.
zh_hans: 记忆证据内容不一致。

source: The memory evidence purge marker is invalid.
zh_hans: 记忆证据清除标记无效。

source: The memory evidence source is outside its workspace scope.
zh_hans: 记忆证据源不在其工作空间范围内。

source: The memory evidence source message is invalid.
zh_hans: 记忆证据源消息无效。

source: The memory has already been forgotten.
zh_hans: 记忆已经遗忘。

source: The memory identifier is invalid.
zh_hans: 记忆标识无效。

source: The memory identity points to missing data.
zh_hans: 记忆标识指向的数据不存在。

source: The memory is no longer authorized for this execution.
zh_hans: 记忆已不再获此执行授权。

source: The memory is not available for recall.
zh_hans: 记忆不可用于召回。

source: The memory operation ID was already used with different content.
zh_hans: 该记忆操作 ID 已用于不同内容。

source: The memory operation receipt is invalid.
zh_hans: 记忆操作回执无效。

source: The memory operation receipt points to missing data.
zh_hans: 记忆操作回执指向的数据不存在。

source: The memory proposal changed after authorization.
zh_hans: 记忆提案在授权后发生了变化。

source: The memory proposal does not contain a valid scope value.
zh_hans: 记忆提案不包含有效的范围值。

source: The memory proposal does not contain a valid sensitivity value.
zh_hans: 记忆提案不包含有效的敏感性值。

source: The memory proposal does not match the reviewed content.
zh_hans: 记忆提案与已审核内容不匹配。

source: The memory proposal is no longer active.
zh_hans: 记忆提案已不再有效。

source: The memory proposal was not dispatched.
zh_hans: 记忆提案尚未发送。

source: The memory replacement contents are inconsistent.
zh_hans: 记忆替代内容不一致。

source: The memory replacement state is out of date.
zh_hans: 记忆替换状态已过期。

source: The memory revision contents are inconsistent.
zh_hans: 记忆修订内容不一致。

source: The memory revision is no longer available for this execution.
zh_hans: 记忆修订版本不再可用于此执行。

source: The memory revision is out of date for this execution.
zh_hans: 该执行使用的记忆修订号已过期。

source: The memory revision is out of date.
zh_hans: 记忆修订已过期。

source: The memory revision scope or subject is inconsistent.
zh_hans: 记忆修订范围或主题不一致。

source: The memory save was not approved.
zh_hans: 记忆保存未获批准。

source: The memory scope does not match the reviewed content.
zh_hans: 记忆范围与已审核内容不匹配。

source: The memory scope is invalid.
zh_hans: 记忆范围无效。

source: The memory source fields do not match its evidence.
zh_hans: 记忆源字段与其证据不匹配。

source: The memory source suppression is missing.
zh_hans: 缺少记忆源抑制记录。

source: The memory suppression record is inconsistent.
zh_hans: 记忆抑制记录不一致。

source: The memory suppression record is invalid.
zh_hans: 记忆抑制记录无效。

source: The memory suppression source is invalid.
zh_hans: 记忆抑制源无效。

source: The memory to replace does not exist.
zh_hans: 要替换的记忆不存在。

source: The memory to replace is no longer available.
zh_hans: 要替换的记忆已不可用。

source: The memory tool context is no longer authorized.
zh_hans: 记忆工具上下文已不再获得授权。

source: The memory tool invocation arguments are missing.
zh_hans: 记忆工具调用参数缺失。

source: The memory tool invocation does not exist.
zh_hans: 记忆工具调用不存在。

source: The memory tool invocation is no longer authorized.
zh_hans: 记忆工具调用已不再获得授权。

source: The memory usage record is invalid.
zh_hans: 记忆使用记录无效。

source: The memory usage revision is out of date.
zh_hans: 记忆使用修订已过期。

source: The memory usage revisions disagree.
zh_hans: 记忆使用修订号不一致。

source: The message cannot be empty.
zh_hans: 消息不能为空。

source: The model attempt does not exist.
zh_hans: 模型尝试不存在。

source: The model attempt has already finished or its body was purged.
zh_hans: 模型尝试已完成，或其正文已清除。

source: The model attempt has already finished.
zh_hans: 模型尝试已经结束。

source: The model attempt has neither output nor an error.
zh_hans: 模型尝试缺少输出或错误。

source: The model configuration relationships are invalid.
zh_hans: 模型配置关系无效。

source: The model descriptor contents are inconsistent.
zh_hans: 模型描述内容不一致。

source: The model descriptor does not exist.
zh_hans: 模型描述不存在。

source: The model descriptor is based on an outdated provider connection.
zh_hans: 模型描述基于过期的提供商连接。

source: The model descriptor no longer exists.
zh_hans: 模型描述已不存在。

source: The model descriptor revision is out of date.
zh_hans: 模型描述版本已过期。

source: The model returned no text. Check this model's interface capabilities and retry.
zh_hans: 模型未返回文本，请检查此模型的接口能力后重试。

source: The model route contents are inconsistent.
zh_hans: 模型路由内容不一致。

source: The model route does not exist.
zh_hans: 模型路由不存在。

source: The model route information is invalid.
zh_hans: 模型路线信息无效。

source: The model route no longer exists.
zh_hans: 模型路线已不存在。

source: The model route revision is out of date.
zh_hans: 模型路线修订号已过期。

source: The previous model output has not been submitted.
zh_hans: 上一步模型输出尚未提交。

source: The previous tool result has not been submitted.
zh_hans: 上一次工具结果尚未提交。

source: The provider connection contents are inconsistent.
zh_hans: 提供商连接内容不一致。

source: The provider connection does not exist.
zh_hans: 提供商连接不存在。

source: The provider connection ended before generation completed.
zh_hans: 服务连接在生成完成前中断。

source: The provider connection no longer exists.
zh_hans: 提供商连接已不存在。

source: The provider connection revision is out of date.
zh_hans: 提供商连接版本已过期。

source: The provider credential is unavailable.
zh_hans: 服务凭据不可用。

source: The provider credential reference is invalid.
zh_hans: 模型服务的凭据引用无效。

source: The provider credential was rejected.
zh_hans: 服务凭据未被接受。

source: The provider is temporarily unavailable; try again later.
zh_hans: 服务暂时不可用，请稍后重试。

source: The provider model no longer exists.
zh_hans: 提供商模型已不存在。

source: The provider rejected the request.
zh_hans: 服务拒绝了请求。

source: The provider returned an unparseable stream.
zh_hans: 服务返回了无法解析的流。

source: The provider route changed before the memory could be saved.
zh_hans: 保存记忆前提供商路由已发生变化。

source: The provider route no longer exists.
zh_hans: 提供商路由已不存在。
